import React, { Component } from 'react'

import './PlotArticle.css'

export class PlotArticle extends Component {
  render() {
    return (
      <div>
        <h2>Краткий сюжет</h2>
        <p>Главный герой фильма — мальчик Чарли Бакет из бедной семьи, 
          живущий в небольшой лачуге вместе со своими родителями, двумя дедушками и двумя бабушками.
          Отец Чарли работает на фабрике зубной пасты, закручивая крышки на тюбиках. 
          Когда его увольняют с работы, заменив роботом, семья оказывается в крайне тяжёлом положении. 
          В том же городе находится шоколадная фабрика Вилли Вонки, на которой раньше работал дедушка Чарли — Джо Бакет. 
          После того как конкуренты выкрали шоколадные секреты магната, тот уволил всех рабочих.
          С тех пор никто ни разу не видел, чтобы люди заходили на фабрику или выходили из неё. 
          Только грузовики, развозящие шоколад, иногда заезжали за ворота фабрики. 
          Но однажды из труб пошёл дым — значит, там всё-таки кто-то работал, 
          хотя для всех оставалось тайной, что это были за рабочие. 
          Однажды мистер Вонка положил в пять плиток шоколада по одному золотому билету и объявил, что те дети, 
          которым выпадет шанс найти билеты, получат возможность попасть на фабрику. 
          После экскурсии каждый из них получит пожизненное обеспечение шоколадом, 
          а один будет награждён неким особенным призом.</p>
      </div>
    )
  }
}

export default PlotArticle